Res-hotel/Res-container-random-v1/container_t_4_c_6_frontCore_1_wrkCore_2/wrk.txt
Running 1m test @ http://128.226.119.92:5000
  4 threads and 6 connections
  Thread calibration: mean lat.: 4820.377ms, rate sampling interval: 17809ms
  Thread calibration: mean lat.: 4835.289ms, rate sampling interval: 17580ms
  Thread calibration: mean lat.: 4928.765ms, rate sampling interval: 17989ms
  Thread calibration: mean lat.: 4864.033ms, rate sampling interval: 17989ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    26.75s     7.36s   41.32s    69.71%
    Req/Sec   146.00      0.87   147.00     87.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   28.38s 
 75.000%   31.59s 
 90.000%   34.80s 
 99.000%   41.32s 
 99.900%   43.16s 
 99.990%   43.38s 
 99.999%   43.45s 
100.000%   43.45s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9969.663     0.000000            2         1.00
   14753.791     0.100000         2911         1.11
   19660.799     0.200000         5827         1.25
   24625.151     0.300000         8744         1.43
   27049.983     0.400000        11655         1.67
   28377.087     0.500000        14584         2.00
   28999.679     0.550000        16058         2.22
   29605.887     0.600000        17494         2.50
   30228.479     0.650000        18932         2.86
   30883.839     0.700000        20402         3.33
   31588.351     0.750000        21888         4.00
   31899.647     0.775000        22640         4.44
   32194.559     0.800000        23303         5.00
   32505.855     0.825000        24043         5.71
   32833.535     0.850000        24745         6.67
   33390.591     0.875000        25495         8.00
   33980.415     0.887500        25853         8.89
   34799.615     0.900000        26219        10.00
   35618.815     0.912500        26567        11.43
   36405.247     0.925000        26937        13.33
   37093.375     0.937500        27296        16.00
   37486.591     0.943750        27480        17.78
   37912.575     0.950000        27655        20.00
   38305.791     0.956250        27850        22.86
   38666.239     0.962500        28018        26.67
   39092.223     0.968750        28213        32.00
   39288.831     0.971875        28302        35.56
   39518.207     0.975000        28384        40.00
   39714.815     0.978125        28476        45.71
   39911.423     0.981250        28570        53.33
   40271.871     0.984375        28658        64.00
   40566.783     0.985938        28710        71.11
   40861.695     0.987500        28756        80.00
   41156.607     0.989062        28800        91.43
   41451.519     0.990625        28845       106.67
   41746.431     0.992188        28883       128.00
   41943.039     0.992969        28909       142.22
   42139.647     0.993750        28934       160.00
   42237.951     0.994531        28950       182.86
   42369.023     0.995313        28975       213.33
   42565.631     0.996094        29002       256.00
   42663.935     0.996484        29012       284.44
   42762.239     0.996875        29025       320.00
   42860.543     0.997266        29041       365.71
   42860.543     0.997656        29041       426.67
   42958.847     0.998047        29056       512.00
   43057.151     0.998242        29069       568.89
   43057.151     0.998437        29069       640.00
   43122.687     0.998633        29070       731.43
   43155.455     0.998828        29081       853.33
   43155.455     0.999023        29081      1024.00
   43253.759     0.999121        29091      1137.78
   43253.759     0.999219        29091      1280.00
   43253.759     0.999316        29091      1462.86
   43319.295     0.999414        29093      1706.67
   43352.063     0.999512        29105      2048.00
   43352.063     0.999561        29105      2275.56
   43352.063     0.999609        29105      2560.00
   43352.063     0.999658        29105      2925.71
   43352.063     0.999707        29105      3413.33
   43352.063     0.999756        29105      4096.00
   43352.063     0.999780        29105      4551.11
   43352.063     0.999805        29105      5120.00
   43352.063     0.999829        29105      5851.43
   43352.063     0.999854        29105      6826.67
   43384.831     0.999878        29106      8192.00
   43384.831     0.999890        29106      9102.22
   43450.367     0.999902        29109     10240.00
   43450.367     1.000000        29109          inf
#[Mean    =    26750.217, StdDeviation   =     7357.974]
#[Max     =    43417.600, Total count    =        29109]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  35296 requests in 1.00m, 14.69MB read
  Socket errors: connect 0, read 0, write 0, timeout 32
Requests/sec:    588.20
Transfer/sec:    250.76KB